adamkondraciuk/nrfx/mdk/iar_startup_nrf7120_umac.s
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved

__Vectors_End
__Vectors                           EQU   __vector_table
__Vectors_Size                      EQU   __Vectors_End - __Vectors


; Default handlers.
        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler

    jal ra, SystemInit
    j __iar_program_start

        ; Dummy exception handlers


        PUBWEAK UserSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserSoftware_Handler
        j .

        PUBWEAK SuperVisorSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorSoftware_Handler
        j .

        PUBWEAK MachineSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineSoftware_Handler
        j .

        PUBWEAK UserTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserTimer_Handler
        j .

        PUBWEAK SuperVisorTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorTimer_Handler
        j .

        PUBWEAK MachineTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineTimer_Handler
        j .

        PUBWEAK UserExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserExternal_Handler
        j .

        PUBWEAK SuperVisorExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorExternal_Handler
        j .

        PUBWEAK MachineExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineExternal_Handler
        j .

        PUBWEAK CLICSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
CLICSoftware_Handler
        j .


       ; Dummy interrupt handlers

        PUBWEAK  UMACCLIC_16_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_16_IRQHandler
        j .

        PUBWEAK  UMACCLIC_17_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_17_IRQHandler
        j .

        PUBWEAK  UMACCLIC_18_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_18_IRQHandler
        j .

        PUBWEAK  UMACCLIC_19_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_19_IRQHandler
        j .

        PUBWEAK  UMACCLIC_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_20_IRQHandler
        j .

        PUBWEAK  UMACCLIC_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_21_IRQHandler
        j .

        PUBWEAK  UMACCLIC_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_22_IRQHandler
        j .

        PUBWEAK  UMACCLIC_23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_23_IRQHandler
        j .

        PUBWEAK  UMACCLIC_24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_24_IRQHandler
        j .

        PUBWEAK  UMACCLIC_25_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_25_IRQHandler
        j .

        PUBWEAK  UMACCLIC_26_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMACCLIC_26_IRQHandler
        j .

        PUBWEAK  RPU_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_0_IRQHandler
        j .

